ninety-nine-cats/app/controllers/cats_controller.rb

    def create
        cat = Cat.new(cat_params)

        if cat && cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["birth_date", "2014-03-15"], ["color", "black"], ["name", "messi"], ["sex", "f"], ["description", nil], ["created_at", "2022-11-12 00:17:08.876308"], ["updated_at", "2022-11-12 00:17:08.876308"]]

    def update
        cat = Cat.find_by(id: params[:id])
        if cat && cat.update(cat_params)
---
SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "cats" SET "description" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["description", "Soccer pro"], ["updated_at", "2022-11-12 00:23:43.878398"], ["id", 5]]